Linked properties in highlighted elements cause a circular chain of references.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ElementPropLinkCircularChainError { get; }
  Visual Basic
Public Shared ReadOnly Property ElementPropLinkCircularChainError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ElementPropLinkCircularChainError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GlobalParameterFailures Class
  Autodesk.Revit.DB Namespace